Tekla Open API Reference for Tekla Structures 2025
CustomPartPositioningTypeAttribute Properties
The CustomPartPositioningTypeAttribute type exposes the following members.
Properties
Name | Description
Type
 The custom attribute uses this to store the positioning type to the system. This is not to be used by itself.
Top
See Also
Reference
CustomPartPositioningTypeAttribute Class
Tekla.Structures.Plugins Namespace